; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite4 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	satellite6 - satellite
	instrument8 - instrument
	satellite7 - satellite
	instrument9 - instrument
	instrument10 - instrument
	image2 - mode
	infrared1 - mode
	spectrograph3 - mode
	infrared4 - mode
	image0 - mode
	GroundStation4 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	Star2 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared4)
	(supports instrument0 infrared1)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon5)
	(supports instrument1 infrared1)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument2 image2)
	(supports instrument2 infrared4)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument3 infrared4)
	(supports instrument3 infrared1)
	(supports instrument3 spectrograph3)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image0)
	(supports instrument4 spectrograph3)
	(supports instrument4 infrared4)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite3)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument5 infrared4)
	(supports instrument5 infrared1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star2)
	(supports instrument6 infrared1)
	(supports instrument6 image2)
	(calibration_target instrument6 Star3)
	(on_board instrument5 satellite4)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation1)
	(supports instrument7 infrared4)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument7 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star9)
	(supports instrument8 infrared4)
	(supports instrument8 infrared1)
	(supports instrument8 image2)
	(calibration_target instrument8 Star3)
	(on_board instrument8 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star11)
	(supports instrument9 infrared4)
	(calibration_target instrument9 Star2)
	(supports instrument10 infrared4)
	(supports instrument10 infrared1)
	(calibration_target instrument10 Star2)
	(on_board instrument9 satellite7)
	(on_board instrument10 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Phenomenon5)
)
(:goal (and
	(pointing satellite2 GroundStation1)
	(pointing satellite3 GroundStation0)
	(pointing satellite4 Planet6)
	(pointing satellite6 GroundStation0)
	(have_image Phenomenon5 spectrograph3)
	(have_image Planet6 infrared1)
	(have_image Star7 spectrograph3)
	(have_image Planet8 infrared4)
	(have_image Star9 infrared1)
	(have_image Phenomenon10 infrared4)
	(have_image Star11 spectrograph3)
))

)

; plan
1. (turn_to satellite4 planet6 groundstation1)
   deleted: (pointing satellite4 groundstation1)
   added: (pointing satellite4 planet6)
   goals met: 1 of 11
2. (turn_to satellite3 groundstation0 star2)
   deleted: (pointing satellite3 star2)
   added: (pointing satellite3 groundstation0)
   goals met: 2 of 11
3. (switch_on instrument3 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument3)
   goals met: 2 of 11
4. (calibrate satellite3 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 2 of 11
5. (turn_to satellite3 planet6 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 planet6)
   goals met: 1 of 11
6. (take_image satellite3 planet6 instrument3 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 2 of 11
7. (turn_to satellite3 phenomenon5 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 phenomenon5)
   goals met: 2 of 11
8. (take_image satellite3 phenomenon5 instrument3 spectrograph3)
   added: (have_image phenomenon5 spectrograph3)
   goals met: 3 of 11
9. (turn_to satellite3 phenomenon10 phenomenon5)
   deleted: (pointing satellite3 phenomenon5)
   added: (pointing satellite3 phenomenon10)
   goals met: 3 of 11
10. (turn_to satellite2 groundstation1 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 groundstation1)
   goals met: 4 of 11
11. (take_image satellite3 phenomenon10 instrument3 infrared4)
   added: (have_image phenomenon10 infrared4)
   goals met: 5 of 11
12. (turn_to satellite3 planet8 phenomenon10)
   deleted: (pointing satellite3 phenomenon10)
   added: (pointing satellite3 planet8)
   goals met: 5 of 11
13. (take_image satellite3 planet8 instrument3 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 6 of 11
14. (turn_to satellite3 star11 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 star11)
   goals met: 6 of 11
15. (take_image satellite3 star11 instrument3 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 7 of 11
16. (turn_to satellite3 star7 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star7)
   goals met: 7 of 11
17. (take_image satellite3 star7 instrument3 spectrograph3)
   added: (have_image star7 spectrograph3)
   goals met: 8 of 11
18. (turn_to satellite3 star9 star7)
   deleted: (pointing satellite3 star7)
   added: (pointing satellite3 star9)
   goals met: 8 of 11
19. (take_image satellite3 star9 instrument3 infrared1)
   added: (have_image star9 infrared1)
   goals met: 9 of 11
20. (turn_to satellite3 groundstation0 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 groundstation0)
   goals met: 10 of 11
21. (turn_to satellite6 groundstation0 star11)
   deleted: (pointing satellite6 star11)
   added: (pointing satellite6 groundstation0)
   goals met: 11 of 11
